app/controllers/application_controller.rb

  def load_cart
    @current_order = Order.find_by(number: session['order_number'])
---
SELECT "orders".* FROM "orders" WHERE "orders"."number" IS NULL LIMIT $1  [["LIMIT", 1]]